<?xml version="1.0"?>
<net name="main_graph" version="11">
	<layers>
		<layer id="0" name="input" type="Parameter" version="opset1">
			<data shape="1,3,256,256" element_type="f32" />
			<output>
				<port id="0" precision="FP32" names="input">
					<dim>1</dim>
					<dim>3</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="conv_layer.0.weight_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="16, 3, 2, 2" offset="0" size="384" />
			<output>
				<port id="0" precision="FP16" names="conv_layer.0.weight">
					<dim>16</dim>
					<dim>3</dim>
					<dim>2</dim>
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="2" name="conv_layer.0.weight" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>16</dim>
					<dim>3</dim>
					<dim>2</dim>
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>16</dim>
					<dim>3</dim>
					<dim>2</dim>
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="3" name="/conv_layer/conv_layer.0/Conv/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>16</dim>
					<dim>3</dim>
					<dim>2</dim>
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>257</dim>
					<dim>257</dim>
				</port>
			</output>
		</layer>
		<layer id="4" name="Reshape_25_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 16, 1, 1" offset="384" size="32" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="5" name="Reshape_25" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="/conv_layer/conv_layer.0/Conv" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>257</dim>
					<dim>257</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/conv_layer/conv_layer.0/Conv_output_0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>257</dim>
					<dim>257</dim>
				</port>
			</output>
		</layer>
		<layer id="7" name="conv_layer.1.weight_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="16, 16, 2, 2" offset="416" size="2048" />
			<output>
				<port id="0" precision="FP16" names="conv_layer.1.weight">
					<dim>16</dim>
					<dim>16</dim>
					<dim>2</dim>
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="8" name="conv_layer.1.weight" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>16</dim>
					<dim>16</dim>
					<dim>2</dim>
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>16</dim>
					<dim>16</dim>
					<dim>2</dim>
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="9" name="/conv_layer/conv_layer.1/Conv/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>257</dim>
					<dim>257</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>16</dim>
					<dim>16</dim>
					<dim>2</dim>
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>258</dim>
					<dim>258</dim>
				</port>
			</output>
		</layer>
		<layer id="10" name="Reshape_38_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 16, 1, 1" offset="2464" size="32" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="11" name="Reshape_38" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="12" name="/conv_layer/conv_layer.1/Conv" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>258</dim>
					<dim>258</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/conv_layer/conv_layer.1/Conv_output_0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>258</dim>
					<dim>258</dim>
				</port>
			</output>
		</layer>
		<layer id="13" name="/conv_layer/conv_layer.2/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>258</dim>
					<dim>258</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/conv_layer/conv_layer.2/Relu_output_0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>258</dim>
					<dim>258</dim>
				</port>
			</output>
		</layer>
		<layer id="14" name="/conv_layer/conv_layer.3/MaxPool" type="MaxPool" version="opset8">
			<data strides="2, 2" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" kernel="2, 2" rounding_type="floor" auto_pad="explicit" index_element_type="i64" axis="0" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>258</dim>
					<dim>258</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/conv_layer/conv_layer.3/MaxPool_output_0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>129</dim>
					<dim>129</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
					<dim>16</dim>
					<dim>129</dim>
					<dim>129</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="conv_layer.4.weight_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="32, 16, 2, 2" offset="2496" size="4096" />
			<output>
				<port id="0" precision="FP16" names="conv_layer.4.weight">
					<dim>32</dim>
					<dim>16</dim>
					<dim>2</dim>
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="16" name="conv_layer.4.weight" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>32</dim>
					<dim>16</dim>
					<dim>2</dim>
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>16</dim>
					<dim>2</dim>
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="17" name="/conv_layer/conv_layer.4/Conv/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>129</dim>
					<dim>129</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>16</dim>
					<dim>2</dim>
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>130</dim>
					<dim>130</dim>
				</port>
			</output>
		</layer>
		<layer id="18" name="Reshape_53_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 32, 1, 1" offset="6592" size="64" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="19" name="Reshape_53" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="20" name="/conv_layer/conv_layer.4/Conv" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>130</dim>
					<dim>130</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/conv_layer/conv_layer.4/Conv_output_0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>130</dim>
					<dim>130</dim>
				</port>
			</output>
		</layer>
		<layer id="21" name="conv_layer.5.weight_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="32, 32, 2, 2" offset="6656" size="8192" />
			<output>
				<port id="0" precision="FP16" names="conv_layer.5.weight">
					<dim>32</dim>
					<dim>32</dim>
					<dim>2</dim>
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="22" name="conv_layer.5.weight" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>32</dim>
					<dim>32</dim>
					<dim>2</dim>
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>32</dim>
					<dim>2</dim>
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="23" name="/conv_layer/conv_layer.5/Conv/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>130</dim>
					<dim>130</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>32</dim>
					<dim>2</dim>
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>131</dim>
					<dim>131</dim>
				</port>
			</output>
		</layer>
		<layer id="24" name="Reshape_66_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 32, 1, 1" offset="14848" size="64" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="25" name="Reshape_66" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="26" name="/conv_layer/conv_layer.5/Conv" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>131</dim>
					<dim>131</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/conv_layer/conv_layer.5/Conv_output_0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>131</dim>
					<dim>131</dim>
				</port>
			</output>
		</layer>
		<layer id="27" name="/conv_layer/conv_layer.6/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>131</dim>
					<dim>131</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/conv_layer/conv_layer.6/Relu_output_0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>131</dim>
					<dim>131</dim>
				</port>
			</output>
		</layer>
		<layer id="28" name="/conv_layer/conv_layer.7/MaxPool" type="MaxPool" version="opset8">
			<data strides="2, 2" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" kernel="2, 2" rounding_type="floor" auto_pad="explicit" index_element_type="i64" axis="0" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>131</dim>
					<dim>131</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/conv_layer/conv_layer.7/MaxPool_output_0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>65</dim>
					<dim>65</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
					<dim>32</dim>
					<dim>65</dim>
					<dim>65</dim>
				</port>
			</output>
		</layer>
		<layer id="29" name="conv_layer.8.weight_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="64, 32, 2, 2" offset="14912" size="16384" />
			<output>
				<port id="0" precision="FP16" names="conv_layer.8.weight">
					<dim>64</dim>
					<dim>32</dim>
					<dim>2</dim>
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="30" name="conv_layer.8.weight" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>64</dim>
					<dim>32</dim>
					<dim>2</dim>
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>64</dim>
					<dim>32</dim>
					<dim>2</dim>
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="31" name="/conv_layer/conv_layer.8/Conv/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>65</dim>
					<dim>65</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>64</dim>
					<dim>32</dim>
					<dim>2</dim>
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>66</dim>
					<dim>66</dim>
				</port>
			</output>
		</layer>
		<layer id="32" name="Reshape_81_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 64, 1, 1" offset="31296" size="128" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="33" name="Reshape_81" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="34" name="/conv_layer/conv_layer.8/Conv" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>66</dim>
					<dim>66</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/conv_layer/conv_layer.8/Conv_output_0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>66</dim>
					<dim>66</dim>
				</port>
			</output>
		</layer>
		<layer id="35" name="conv_layer.9.weight_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="64, 64, 2, 2" offset="31424" size="32768" />
			<output>
				<port id="0" precision="FP16" names="conv_layer.9.weight">
					<dim>64</dim>
					<dim>64</dim>
					<dim>2</dim>
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="36" name="conv_layer.9.weight" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>64</dim>
					<dim>64</dim>
					<dim>2</dim>
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>64</dim>
					<dim>64</dim>
					<dim>2</dim>
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="37" name="/conv_layer/conv_layer.9/Conv/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>66</dim>
					<dim>66</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>64</dim>
					<dim>64</dim>
					<dim>2</dim>
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>67</dim>
					<dim>67</dim>
				</port>
			</output>
		</layer>
		<layer id="38" name="Reshape_94_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 64, 1, 1" offset="64192" size="128" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="39" name="Reshape_94" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="40" name="/conv_layer/conv_layer.9/Conv" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>67</dim>
					<dim>67</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/conv_layer/conv_layer.9/Conv_output_0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>67</dim>
					<dim>67</dim>
				</port>
			</output>
		</layer>
		<layer id="41" name="/conv_layer/conv_layer.10/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>67</dim>
					<dim>67</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/conv_layer/conv_layer.10/Relu_output_0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>67</dim>
					<dim>67</dim>
				</port>
			</output>
		</layer>
		<layer id="42" name="Range_103" type="Const" version="opset1">
			<data element_type="i64" shape="2" offset="64320" size="16" />
			<output>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="43" name="/conv_layer/conv_layer.11/GlobalAveragePool" type="ReduceMean" version="opset1">
			<data keep_dims="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>67</dim>
					<dim>67</dim>
				</port>
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/conv_layer/conv_layer.11/GlobalAveragePool_output_0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="44" name="/Constant" type="Const" version="opset1">
			<data element_type="i64" shape="2" offset="64336" size="16" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64" names="/Constant_output_0">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="45" name="features" type="Reshape" version="opset1">
			<data special_zero="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="features">
					<dim>1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="46" name="features/sink_port_0" type="Result" version="opset1" output_names="features">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
				</port>
			</input>
		</layer>
	</layers>
	<edges>
		<edge from-layer="0" from-port="0" to-layer="3" to-port="0" />
		<edge from-layer="1" from-port="0" to-layer="2" to-port="0" />
		<edge from-layer="2" from-port="1" to-layer="3" to-port="1" />
		<edge from-layer="3" from-port="2" to-layer="6" to-port="0" />
		<edge from-layer="4" from-port="0" to-layer="5" to-port="0" />
		<edge from-layer="5" from-port="1" to-layer="6" to-port="1" />
		<edge from-layer="6" from-port="2" to-layer="9" to-port="0" />
		<edge from-layer="7" from-port="0" to-layer="8" to-port="0" />
		<edge from-layer="8" from-port="1" to-layer="9" to-port="1" />
		<edge from-layer="9" from-port="2" to-layer="12" to-port="0" />
		<edge from-layer="10" from-port="0" to-layer="11" to-port="0" />
		<edge from-layer="11" from-port="1" to-layer="12" to-port="1" />
		<edge from-layer="12" from-port="2" to-layer="13" to-port="0" />
		<edge from-layer="13" from-port="1" to-layer="14" to-port="0" />
		<edge from-layer="14" from-port="1" to-layer="17" to-port="0" />
		<edge from-layer="15" from-port="0" to-layer="16" to-port="0" />
		<edge from-layer="16" from-port="1" to-layer="17" to-port="1" />
		<edge from-layer="17" from-port="2" to-layer="20" to-port="0" />
		<edge from-layer="18" from-port="0" to-layer="19" to-port="0" />
		<edge from-layer="19" from-port="1" to-layer="20" to-port="1" />
		<edge from-layer="20" from-port="2" to-layer="23" to-port="0" />
		<edge from-layer="21" from-port="0" to-layer="22" to-port="0" />
		<edge from-layer="22" from-port="1" to-layer="23" to-port="1" />
		<edge from-layer="23" from-port="2" to-layer="26" to-port="0" />
		<edge from-layer="24" from-port="0" to-layer="25" to-port="0" />
		<edge from-layer="25" from-port="1" to-layer="26" to-port="1" />
		<edge from-layer="26" from-port="2" to-layer="27" to-port="0" />
		<edge from-layer="27" from-port="1" to-layer="28" to-port="0" />
		<edge from-layer="28" from-port="1" to-layer="31" to-port="0" />
		<edge from-layer="29" from-port="0" to-layer="30" to-port="0" />
		<edge from-layer="30" from-port="1" to-layer="31" to-port="1" />
		<edge from-layer="31" from-port="2" to-layer="34" to-port="0" />
		<edge from-layer="32" from-port="0" to-layer="33" to-port="0" />
		<edge from-layer="33" from-port="1" to-layer="34" to-port="1" />
		<edge from-layer="34" from-port="2" to-layer="37" to-port="0" />
		<edge from-layer="35" from-port="0" to-layer="36" to-port="0" />
		<edge from-layer="36" from-port="1" to-layer="37" to-port="1" />
		<edge from-layer="37" from-port="2" to-layer="40" to-port="0" />
		<edge from-layer="38" from-port="0" to-layer="39" to-port="0" />
		<edge from-layer="39" from-port="1" to-layer="40" to-port="1" />
		<edge from-layer="40" from-port="2" to-layer="41" to-port="0" />
		<edge from-layer="41" from-port="1" to-layer="43" to-port="0" />
		<edge from-layer="42" from-port="0" to-layer="43" to-port="1" />
		<edge from-layer="43" from-port="2" to-layer="45" to-port="0" />
		<edge from-layer="44" from-port="0" to-layer="45" to-port="1" />
		<edge from-layer="45" from-port="2" to-layer="46" to-port="0" />
	</edges>
	<rt_info>
		<Runtime_version value="2025.2.0-19140-c01cd93e24d-releases/2025/2" />
		<conversion_parameters>
			<is_python_object value="False" />
		</conversion_parameters>
	</rt_info>
</net>
